{
    "2024": {
      "Rat": {
        "horoscope": "Your horoscope for 2024 as a Rat: You may find that your social life takes on a more prominent role this year, with opportunities for networking and making new connections. However, be cautious of overextending yourself and maintain balance in all areas of your life."
      },
      "Ox": {
        "horoscope": "Your horoscope for 2024 as an Ox: This year could bring opportunities for professional advancement and financial growth. Focus on your long-term goals and be prepared to work hard to achieve them. Take calculated risks and trust your instincts."
      },
      "Tiger": {
        "horoscope": "Your horoscope for 2024 as a Tiger: Expect a year of transformation and self-discovery. Embrace change and explore new possibilities. Stay true to your values and beliefs, but remain open-minded to new perspectives and experiences."
      },
      "Rabbit": {
        "horoscope": "Your horoscope for 2024 as a Rabbit: This year, focus on nurturing your relationships and creating harmony in your personal and professional life. Practice patience and diplomacy in your interactions, and seek opportunities for growth and learning."
      },
      "Dragon": {
        "horoscope": "Your horoscope for 2024 as a Dragon: You may experience bursts of creativity and inspiration this year, leading to new projects and ventures. Trust in your abilities and pursue your passions with confidence. Stay adaptable and open to unexpected opportunities."
      },
      "Snake": {
        "horoscope": "Your horoscope for 2024 as a Snake: This year, you may find yourself drawn to introspection and self-reflection. Take time to explore your innermost thoughts and emotions. Trust your intuition and be mindful of the energy you surround yourself with."
      },
      "Horse": {
        "horoscope": "Your horoscope for 2024 as a Horse: Expect a year of adventure and exploration. Embrace spontaneity and seek out new experiences. Stay true to your independent nature, but remember to balance freedom with responsibility."
      },
      "Goat": {
        "horoscope": "Your horoscope for 2024 as a Goat: Focus on nurturing your emotional well-being and creating a sense of security in your life. Pay attention to your intuition and trust your instincts when making decisions. Cultivate gratitude and find joy in the present moment."
      },
      "Monkey": {
        "horoscope": "Your horoscope for 2024 as a Monkey: This year may bring opportunities for personal growth and self-improvement. Set ambitious goals and pursue them with determination. Stay adaptable and be willing to embrace change."
      },
      "Rooster": {
        "horoscope": "Your horoscope for 2024 as a Rooster: Expect a year of hard work and productivity. Focus on honing your skills and refining your craft. Stay organized and disciplined in your pursuits, and don't be afraid to seek support when needed."
      },
      "Dog": {
        "horoscope": "Your horoscope for 2024 as a Dog: This year, prioritize your health and well-being above all else. Take time to rest and recharge, and listen to your body's needs. Cultivate strong relationships built on trust and loyalty."
      },
      "Pig": {
        "horoscope": "Your horoscope for 2024 as a Pig: Expect a year of abundance and prosperity. Stay focused on your goals and be proactive in pursuing opportunities for growth. Trust in the universe to provide what you need, and express gratitude for the blessings in your life."
      }
    }
  }
  