[
    { "quote": "The only way to do great work is to love what you do.", "author": "Steve Jobs" },
    { "quote": "If you are working on something that you really care about, you don't have to be pushed. The vision pulls you.", "author": "Steve Jobs" },
    { "quote": "The difference between ordinary and extraordinary is that little extra.", "author": "Jimmy Johnson" },
    { "quote": "Challenges are what make life interesting. Overcoming them is what makes life meaningful.", "author": "Joshua Marine" },
    { "quote": "The way to get started is to quit talking and begin doing.", "author": "Walt Disney" },
    { "quote": "The only limit to our realization of tomorrow will be our doubts of today.", "author": "Franklin D. Roosevelt" },
    { "quote": "Believe you can and you're halfway there.", "author": "Theodore Roosevelt" },
    { "quote": "It does not matter how slowly you go as long as you do not stop.", "author": "Confucius" },
    { "quote": "Our greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time.", "author": "Thomas A. Edison" },
    { "quote": "Don't watch the clock; do what it does. Keep going.", "author": "Sam Levenson" },
    { "quote": "Ever tried. Ever failed. No matter. Try Again. Fail again. Fail better.", "author": "Samuel Beckett" },
    { "quote": "Don't let yesterday take up too much of today.", "author": "Will Rogers" },  
    { "quote": "If you can dream it, you can do it.", "author": "Walt Disney" },
    { "quote": "You must expect great things of yourself before you can do them.", "author": "Michael Jordan" },
    { "quote": "Life is 10% what happens to me and 90% of how I react to it.", "author": "Charles Swindoll" },
    { "quote": "The mind is everything. What you think you become.",  "author": "Buddha" },
    { "quote": "The best and most beautiful things in the world cannot be seen or even touched - they must be felt with the heart.", "author": "Helen Keller" },
    { "quote": "The only person you are destined to become is the person you decide to be.", "author": "Ralph Waldo Emerson"},
    { "quote": "The only thing that stands between you and your dream is the will to try and the belief that it is actually possible.", "author": "Joel Brown" },
    { "quote": "Start where you are. Use what you have. Do what you can.", "author": "Arthur Ashe" },
    { "quote": "Everything you can imagine is real.", "author": "Pablo Picasso" },
    { "quote": "You must be the change you wish to see in the world.", "author": "Mahatma Gandhi" },
    { "quote": "Fall seven times and stand up eight.", "author": "Japanese Proverb" },
    { "quote": "Twenty years from now you will be more disappointed by the things that you didn't do than by the ones you did do.", "author": "Mark Twain" },
    { "quote": "Don't be afraid to give up the good to go for the great.", "author": "John D. Rockefeller" },
    { "quote": "I have not failed. I've just found 10,000 ways that won't work.", "author": "Thomas A. Edison" },
    { "quote": "The greatest glory in living lies not in never falling, but in rising every time we fall.", "author": "Nelson Mandela" },
    { "quote": "If you don't design your own life plan, chances are you'll fall into someone else's plan. And guess what they have planned for you? Not much.", "author": "Jim Rohn" },
    { "quote": "It is during our darkest moments that we must focus to see the light.", "author": "Aristotle" },
    { "quote": "Your time is limited, so don’t waste it living someone else’s life.", "author": "Steve Jobs" }   
  ]
  